Revit 2027 API
PolylineSegments Properties
The PolylineSegments type exposes the following members.
Properties
Name | Description
EndLocalParameter |  Local parameter associated with the end point.
EndParameter |  Parameter associated with the end point.
IsFilled |  Indicates whether the area enclosed by the polyline is to be filled or not.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LineProperties |  Access to the line (pen) properties of the polyline
StartLocalParameter |  Local parameter associated with the start point.
StartParameter |  Parameter associated with the start point.
Top
See Also
Reference
PolylineSegments Class
Autodesk.Revit.DB Namespace